-- добавление пользователей
INSERT INTO users (first_name, last_name, email, password, avatar)
VALUES
('Ivan', 'Ivanov', 'ivan@fmail.com', 'qwerty', 'avatar'),
('Maria', 'Ivanova', 'maria@fmail.com', 'ytrewq', 'foto');

-- добавление типов объявлений
INSERT INTO types (title)
VALUES
('offer'),
('sale');

-- добавление объявлений
INSERT INTO offers (title, description, sum, created_date, picture, user_id, type_id)
VALUES
(
 'Продам книги Стивена Кинга',
  'Если найдёте дешевле — сброшу цену. Таких предложений больше нет! Две страницы заляпаны свежим кофе',
  20,
  '2020-12-03',
  'picture',
  2,
  1
),
(
 'Продам новую приставку Sony Playstation 5',
  'При покупке с меня бесплатная доставка в черте города',
  30,
  '2019-12-03',
  'foto',
  1,
  2
),
(
 'Продам куртку Адидас',
  'Продаю с болью в сердце... Бонусом отдам все аксессуары. Даю недельную гарантию.',
  10,
  '2020-12-07',
  'picture',
  1,
  1
),
(
 'Куплю детские санки',
  'Если найдёте дешевле — сброшу цену.',
  3,
  '2020-12-08',
  'foto',
  1,
  1
),
(
 'Куплю породистого кота',
  'Не пытайтесь торговаться. Цену вещам я знаю. Великолепно откручивает, сцепление с руками идеально',
  15,
  '2020-12-02',
  'portrait',
  2,
  1
);

-- добавление комментариев
INSERT INTO comments (text, created_date, offer_id, user_id)
VALUES
(
 'Почему в таком ужасном состоянии?',
  '2020-12-08',
  1,
  1
),
(
 'Совсем немного...',
  '2020-12-08',
  1,
  2
),
(
 'А сколько игр в комплекте?',
  '2020-12-29',
  2,
  1
),
(
 'Совсем немного...',
  '2020-12-28',
  2,
  2
),
(
 'Неплохо, но дорого.',
  '2020-12-29',
  3,
  1
),
(
 'Оплата наличными или перевод на карту?',
  '2020-12-28',
  3,
  2
),
(
 'Вы что?! В магазине дешевле.',
  '2020-12-30',
  4,
  1
),
(
 'Оплата наличными или перевод на карту?',
  '2020-12-31',
  4,
  2
),
(
 'С чем связана продажа? Почему так дешёво?',
  '2020-12-29',
  5,
  1
),
(
 'Оплата наличными или перевод на карту?',
  '2020-12-31',
  5,
  2
);

-- добавление категорий
INSERT INTO categories (title)
VALUES
('Книги'),
('Разное'),
('Посуда'),
('Игры'),
('Животные'),
('Журналы'),
('Недвижимость'),
('Авто'),
('Игрушки для взрослых'),
('Еда'),
('Стойматериалы'),
('Одежда'),
('Косметика и парфюмерия'),
('Бытовая техника');

-- связь категорий с объявлениями
INSERT INTO offers_categories (offer_id, category_id)
VALUES
(1, 4),
(1, 3),
(1, 14),
(1, 13),
(2, 4),
(2, 8),
(2, 12),
(3, 12),
(4, 12),
(4, 13),
(5, 13);
