'use strict';

module.exports = [
  {
    "category": [
      `Разное`,
      `Одежда`
    ],
    "description": `Кажется, что это хрупкая вещь Бонусом отдам все аксессуары. При покупке с меня бесплатная доставка в черте города Две страницы заляпаны свежим кофе`,
    "picture": `item11.jpg`,
    "title": `Продам коллекцию журналов «Огонёк»`,
    "type": `SALE`,
    "sum": 74905,
    "id": `0p23fx`,
    "comments": [
      {
        "id": `S1aCH1`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. С чем связана продажа? Почему так дешёво?`
      },
      {
        "id": `j0N60a`,
        "text": `А сколько игр в комплекте? Оплата наличными или перевод на карту?`
      },
      {
        "id": `lhd1_0`,
        "text": `А где блок питания? Вы что?! В магазине дешевле.`
      }
    ]
  },
  {
    "category": [
      `Игрушки для взрослых`
    ],
    "description": `Великолепно откручивает, сцепление с руками идеально Таких предложений больше нет! Это настоящая находка для коллекционера! Практически неношенная. Классика.`,
    "picture": `item01.jpg`,
    "title": `Продам новую приставку Sony Playstation 5`,
    "type": `SALE`,
    "sum": 12141,
    "id": `ilSg24`,
    "comments": [
      {
        "id": `yNXM5i`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту?`
      },
      {
        "id": `sp0gbD`,
        "text": `С чем связана продажа? Почему так дешёво?`
      }
    ]
  },
  {
    "category": [
      `Косметика и парфюмерия`,
      `Стойматериалы`
    ],
    "description": `Таких предложений больше нет! Продаю с болью в сердце... Товар в отличном состоянии. Кому нужен этот новый телефон, если тут такое...`,
    "picture": `item14.jpg`,
    "title": `Продам коллекцию журналов «Огонёк»`,
    "type": `OFFER`,
    "sum": 41493,
    "id": `ikHElv`,
    "comments": [
      {
        "id": `mwWlGM`,
        "text": `А где блок питания? Продаю в связи с переездом. Отрываю от сердца.`
      },
      {
        "id": `v-xkhj`,
        "text": `Совсем немного...`
      },
      {
        "id": `A6zwTa`,
        "text": `Оплата наличными или перевод на карту? А сколько игр в комплекте? А где блок питания?`
      },
      {
        "id": `zGtqFJ`,
        "text": `Почему в таком ужасном состоянии? Совсем немного...`
      }
    ]
  },
  {
    "category": [
      `Одежда`
    ],
    "description": `Это настоящая находка для коллекционера! Мой дед не мог её сломать Бонусом отдам все аксессуары. Кажется, что это хрупкая вещь`,
    "picture": `item09.jpg`,
    "title": `Куплю детские санки`,
    "type": `SALE`,
    "sum": 57990,
    "id": `1w4LSq`,
    "comments": [
      {
        "id": `EYO6wm`,
        "text": `А где блок питания?`
      },
      {
        "id": `07XwJd`,
        "text": `Неплохо, но дорого.`
      }
    ]
  },
  {
    "category": [
      `Посуда`,
      `Еда`
    ],
    "description": `Бонусом отдам все аксессуары. Даю недельную гарантию. Кажется, что это хрупкая вещь Практически неношенная. Классика.`,
    "picture": `item04.jpg`,
    "title": `Продам куртку Адидас`,
    "type": `SALE`,
    "sum": 46812,
    "id": `J_WU0g`,
    "comments": [
      {
        "id": `fan1qW`,
        "text": `Оплата наличными или перевод на карту? А где блок питания?`
      },
      {
        "id": `F1vauy`,
        "text": `С чем связана продажа? Почему так дешёво? Совсем немного...`
      }
    ]
  }
];
