'use strict';

const mockCategories = [
  `Животные`,
  `Журналы`,
  `Игры`
];


const mockOffers = [
  {
    "categories": [
      `Животные`,
      `Журналы`
    ],
    "description": `Даю недельную гарантию. Вывезу любые количества мусора с ваших глаз долой. Нужна зверушка, чтобы мяукала и ее можно было гладить. Некусачая. Возможна ипотека.`,
    "picture": `item10.jpg`,
    "title": `Куплю породистого кота`,
    "type": `SALE`,
    "sum": 97892,
    "comments": [
      {
        "text": `Оплата наличными или перевод на карту?`
      },
      {
        "text": `Почему в таком ужасном состоянии?`
      }
    ]
  },
  {
    "categories": [
      `Игры`
    ],
    "description": `Не пытайтесь торговаться. Цену вещам я знаю Практически неношенная. Классика. Товар в отличном состоянии. Мой дед не мог её сломать`,
    "picture": `item16.jpg`,
    "title": `Продам отличную отвертку`,
    "type": `OFFER`,
    "sum": 84843,
    "comments": [
      {
        "text": `А сколько игр в комплекте? С чем связана продажа? Почему так дешёво? А где блок питания?`
      }
    ]
  },
  {
    "categories": [
      `Животные`
    ],
    "description": `Таких предложений больше нет! Это настоящая находка для коллекционера! Бонусом отдам все аксессуары. Кому нужен этот новый телефон, если тут такое...`,
    "picture": `item07.jpg`,
    "title": `Продам новую приставку Sony Playstation 5`,
    "type": `SALE`,
    "sum": 47160,
    "comments": [
      {
        "text": `Совсем немного... Продаю в связи с переездом. Отрываю от сердца.`
      },
      {
        "text": `А где блок питания? Почему в таком ужасном состоянии?`
      },
      {
        "text": `А сколько игр в комплекте?`
      },
      {
        "text": `С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца.`
      }
    ]
  }
];

module.exports = {
  mockCategories,
  mockOffers
};
