'use strict';

module.exports = [
  {
    "category": [
      `Посуда`,
      `Еда`
    ],
    "description": `Даю недельную гарантию. Вывезу любые количества мусора с ваших глаз долой. Нужна зверушка, чтобы мяукала и ее можно было гладить. Некусачая. Возможна ипотека.`,
    "picture": `item10.jpg`,
    "title": `Куплю породистого кота`,
    "type": `SALE`,
    "sum": 97892,
    "id": `UFRVzi`,
    "comments": [
      {
        "id": `L2asWC`,
        "text": `Оплата наличными или перевод на карту?`
      },
      {
        "id": `9M5pcW`,
        "text": `Почему в таком ужасном состоянии?`
      }
    ]
  },
  {
    "category": [
      `Косметика и парфюмерия`,
      `Журналы`
    ],
    "description": `Не пытайтесь торговаться. Цену вещам я знаю Практически неношенная. Классика. Товар в отличном состоянии. Мой дед не мог её сломать`,
    "picture": `item16.jpg`,
    "title": `Продам отличную отвертку`,
    "type": `OFFER`,
    "sum": 84843,
    "id": `4zzRtd`,
    "comments": [
      {
        "id": `LCXTOo`,
        "text": `А сколько игр в комплекте? С чем связана продажа? Почему так дешёво? А где блок питания?`
      }
    ]
  },
  {
    "category": [
      `Авто`
    ],
    "description": `Таких предложений больше нет! Это настоящая находка для коллекционера! Бонусом отдам все аксессуары. Кому нужен этот новый телефон, если тут такое...`,
    "picture": `item07.jpg`,
    "title": `Продам новую приставку Sony Playstation 5`,
    "type": `SALE`,
    "sum": 47160,
    "id": `FXuvFJ`,
    "comments": [
      {
        "id": `sOKPHa`,
        "text": `Совсем немного... Продаю в связи с переездом. Отрываю от сердца.`
      },
      {
        "id": `yXDKqn`,
        "text": `А где блок питания? Почему в таком ужасном состоянии?`
      },
      {
        "id": `AW-o-z`,
        "text": `А сколько игр в комплекте?`
      },
      {
        "id": `flVENU`,
        "text": `С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца.`
      }
    ]
  }
];
