'use strict';

module.exports = [
  {
    "category": [
      `Авто`
    ],
    "description": `Таких предложений больше нет! Нужна зверушка, чтобы мяукала и ее можно было гладить. Некусачая. Это настоящая находка для коллекционера! Товар в отличном состоянии.`,
    "picture": `item09.jpg`,
    "title": `Продам советскую посуду. Почти не разбита`,
    "type": `OFFER`,
    "sum": 63192,
    "id": `5GNIT6`,
    "comments": [
      {
        "id": `L9WWQH`,
        "text": `Продаю в связи с переездом. Отрываю от сердца.`
      },
      {
        "id": `jcXiVc`,
        "text": `Вы что?! В магазине дешевле. Оплата наличными или перевод на карту? Продаю в связи с переездом. Отрываю от сердца.`
      },
      {
        "id": `Lnuhw1`,
        "text": `Почему в таком ужасном состоянии?`
      },
      {
        "id": `0or0Zw`,
        "text": `А где блок питания? С чем связана продажа? Почему так дешёво? Вы что?! В магазине дешевле.`
      }
    ]
  },
  {
    "category": [
      `Косметика и парфюмерия`,
      `Книги`,
      `Журналы`
    ],
    "description": `Нужна зверушка, чтобы мяукала и ее можно было гладить. Некусачая. Если товар не понравится — верну всё до последней копейки. Даю недельную гарантию. Если найдёте дешевле — сброшу цену.`,
    "picture": `item05.jpg`,
    "title": `Куплю детские санки`,
    "type": `OFFER`,
    "sum": 15782,
    "id": `0e-2wn`,
    "comments": [
      {
        "id": `KD2lxS`,
        "text": `С чем связана продажа? Почему так дешёво? Совсем немного... А сколько игр в комплекте?`
      },
      {
        "id": `aK2a2E`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. С чем связана продажа? Почему так дешёво?`
      }
    ]
  },
  {
    "category": [
      `Бытовая техника`,
      `Косметика и парфюмерия`,
      `Недвижимость`
    ],
    "description": `Пользовались бережно и только по большим праздникам. Возможна ипотека. Продаю с болью в сердце... Вывезу любые количества мусора с ваших глаз долой.`,
    "picture": `item15.jpg`,
    "title": `Продам отличную подборку фильмов на VHS`,
    "type": `OFFER`,
    "sum": 41869,
    "id": `QbB1-0`,
    "comments": [
      {
        "id": `WgPfTt`,
        "text": `А сколько игр в комплекте? Вы что?! В магазине дешевле. Оплата наличными или перевод на карту?`
      },
      {
        "id": `IAtReH`,
        "text": `Совсем немного...`
      }
    ]
  },
  {
    "category": [
      `Животные`,
      `Разное`,
      `Игрушки для взрослых`
    ],
    "description": `Возможна ипотека. Две страницы заляпаны свежим кофе Если товар не понравится — верну всё до последней копейки. Продаю с болью в сердце...`,
    "picture": `item01.jpg`,
    "title": `Продам коллекцию журналов «Огонёк»`,
    "type": `SALE`,
    "sum": 30388,
    "id": `SJwn7G`,
    "comments": [
      {
        "id": `SoCWyY`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии? Вы что?! В магазине дешевле.`
      }
    ]
  }
];
