'use strict';

const mockCategories = [
  `Разное`,
  `Одежда`,
  `Игрушки для взрослых`,
  `Косметика и парфюмерия`,
  `Стойматериалы`,
  `Посуда`,
  `Еда`
];


const mockOffers = [
  {
    "user": `ivanov@example.com`,
    "categories": [
      `Разное`,
      `Одежда`
    ],
    "description": `Кажется, что это хрупкая вещь Бонусом отдам все аксессуары. При покупке с меня бесплатная доставка в черте города Две страницы заляпаны свежим кофе`,
    "picture": `item11.jpg`,
    "title": `Продам коллекцию журналов «Огонёк»`,
    "type": `SALE`,
    "sum": 74905,
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. С чем связана продажа? Почему так дешёво?`
      },
      {
        "user": `ivanov@example.com`,
        "text": `А сколько игр в комплекте? Оплата наличными или перевод на карту?`
      },
      {
        "user": `ivanov@example.com`,
        "text": `А где блок питания? Вы что?! В магазине дешевле.`
      }
    ]
  },
  {
    "user": `ivanov@example.com`,
    "categories": [
      `Игрушки для взрослых`
    ],
    "description": `Великолепно откручивает, сцепление с руками идеально Таких предложений больше нет! Это настоящая находка для коллекционера! Практически неношенная. Классика.`,
    "picture": `item01.jpg`,
    "title": `Продам новую приставку Sony Playstation 5`,
    "type": `SALE`,
    "sum": 12141,
    "comments": [
      {
        "user": `petrov@example.com`,
        "text": `Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту?`
      },
      {
        "user": `petrov@example.com`,
        "text": `С чем связана продажа? Почему так дешёво?`
      }
    ]
  },
  {
    "user": `petrov@example.com`,
    "categories": [
      `Косметика и парфюмерия`,
      `Стойматериалы`
    ],
    "description": `Таких предложений больше нет! Продаю с болью в сердце... Товар в отличном состоянии. Кому нужен этот новый телефон, если тут такое...`,
    "picture": `item14.jpg`,
    "title": `Продам коллекцию журналов «Огонёк»`,
    "type": `OFFER`,
    "sum": 41493,
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `А где блок питания? Продаю в связи с переездом. Отрываю от сердца.`
      },
      {
        "user": `ivanov@example.com`,
        "text": `Совсем немного...`
      },
      {
        "user": `ivanov@example.com`,
        "text": `Оплата наличными или перевод на карту? А сколько игр в комплекте? А где блок питания?`
      },
      {
        "user": `ivanov@example.com`,
        "text": `Почему в таком ужасном состоянии? Совсем немного...`
      }
    ]
  },
  {
    "user": `ivanov@example.com`,
    "categories": [
      `Одежда`
    ],
    "description": `Это настоящая находка для коллекционера! Мой дед не мог её сломать Бонусом отдам все аксессуары. Кажется, что это хрупкая вещь`,
    "picture": `item09.jpg`,
    "title": `Куплю детские санки`,
    "type": `SALE`,
    "sum": 57990,
    "comments": [
      {
        "user": `petrov@example.com`,
        "text": `А где блок питания?`
      },
      {
        "user": `petrov@example.com`,
        "text": `Неплохо, но дорого.`
      }
    ]
  },
  {
    "user": `petrov@example.com`,
    "categories": [
      `Посуда`,
      `Еда`
    ],
    "description": `Бонусом отдам все аксессуары. Даю недельную гарантию. Кажется, что это хрупкая вещь Практически неношенная. Классика.`,
    "picture": `item04.jpg`,
    "title": `Продам куртку Адидас`,
    "type": `SALE`,
    "sum": 46812,
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Оплата наличными или перевод на карту? А где блок питания?`
      },
      {
        "user": `ivanov@example.com`,
        "text": `С чем связана продажа? Почему так дешёво? Совсем немного...`
      }
    ]
  }
];

module.exports = {
  mockCategories,
  mockOffers
};
